micropython/micropython/ports/esp32/boards/SEREN_S3/mpconfigboard.h
#ifndef MICROPY_HW_BOARD_NAME
// Can be set by mpconfigboard.cmake.
#define MICROPY_HW_BOARD_NAME               "ZenSpecs"
#endif
#define MICROPY_HW_MCU_NAME                 "s3"
#define MICROPY_PY_SYS_PLATFORM             "ZenSpecs"


// Enable UART REPL for modules that have an external USB-UART and don't use native USB.
#define MICROPY_HW_ENABLE_UART_REPL         (1)

#define MICROPY_HW_I2C0_SCL                 (9)
#define MICROPY_HW_I2C0_SDA                 (8)

